package app;

/**
 * Інтерфейс для реалізації шаблону проектування Command.
 * Визначає методи для виконання операції та її скасування (Undo).
 * Забезпечує підтримку функціоналу скасування дій та створення макрокоманд.
 *
 * @author Aboimov Vlad
 * @version 1.0
 */
public interface Command {
    /**
     * Виконує дію команди.
     * Кожна конкретна реалізація визначає свою логіку обчислень або маніпуляції даними.
     */
    void execute();

    /**
     * Скасовує дію, яка була виконана методом {@link #execute()}.
     * Має повертати стан системи до моменту виконання цієї команди.
     */
    void undo();
}
