package app;

/**
 * Клас для реалізації логіки обчислень згідно з індивідуальним завданням.
 * Виконує знаходження середнього арифметичного функції та підрахунок одиниць
 * у двійковому представленні результату.
 *
 * @author Абоімов Владислав
 * @version 1.0
 */
public class Solver {
    /**
     * Виконує обчислення середнього арифметичного значення функції 1000*sin(a)
     * для чотирьох аргументів та визначає кількість одиниць у двійковому поданні
     * цілої частини результату.
     *
     * @param angles масив з чотирьох довільних аргументів (кутів у радіанах).
     * @return об'єкт {@link DataModel}, що містить вхідні дані та результат обчислень.
     */
    public DataModel calculate(double[] angles) {
        double sum = 0;
        // Обчислення суми значень функції 1000 * sin(alpha)
        for (double a : angles) {
            sum += 1000 * Math.sin(a);
        }
        // Знаходження цілої частини середнього арифметичного
        int avg = (int) (sum / angles.length);
        // Підрахунок кількості одиниць у двійковому поданні (використовується модуль числа)
        int onesCount = Integer.bitCount(Math.abs(avg));

        // Повернення результатів у вигляді об'єкта класу даних
        return new DataModel(angles, onesCount);
    }
}
