package app;

/**
 * Інтерфейс для реалізації шаблону проектування Factory Method (Virtual Constructor).
 * Визначає абстрактний метод для створення об'єктів типу {@link ResultView}.
 * Це дозволяє системі створювати різні типи відображень (текстові, графічні тощо),
 * не прив'язуючись до конкретних класів реалізації.
 *
 * @author Aboimov Vlad
 * @version 1.2
 */
public interface ViewFactory {
    /**
     * Фабрикуючий метод, який повертає новий екземпляр об'єкта відображення.
     * Конкретні реалізації цього інтерфейсу будуть створювати специфічні
     * типи продуктів (наприклад, TextView).
     *
     * @return об'єкт, що реалізує інтерфейс {@link ResultView}.
     */
    ResultView createView();
}
